---
type: ExternalResourceSubFolder
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ExternalResourceSubFolder

`Autodesk.Revit.DB.ExternalResourceSubFolder` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalResourceSubFolder | — | `` |
| Constructor | ExternalResourceSubFolder | 2019.1 | `public ExternalResourceSubFolder ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FolderName | 2019.1 | `public string FolderName { get ; set ; }` |
| Property | IconPath | 2019.1 | `public string IconPath { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |